[net]
batch=1
subdivisions=1
height=64
width=64
channels=3
learning_rate=0.001
momentum=0.9
decay=0.0005
max_batches=46000

[convolutional]
filters=8
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=8
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=256
activation=relu

[dropout]
probability=.5

[connected]
output=256
activation=relu

[dropout]
probability=.5

[connected]
output=2
activation=linear

[softmax]
groups=1

[cost]
type=sse

